### The code is to filter module BBB for studentAssessment.csv file

In [1]:
# Import pandas library
import pandas as pd

In [2]:
root_path = 'D:/Data Projects/Data Analyst Imperial College/Uploaded Doc'

In [3]:
# Create a dataframe and import data
df = pd.read_csv(f'{root_path}/OULAD_raw/studentAssessment.csv')
df.count()

id_assessment     173912
id_student        173912
date_submitted    173912
is_banked         173912
score             173739
dtype: int64

In [4]:
# Read assessments.csv to adding code_module for filtering BBB
df_assessments = pd.read_csv('D:/Data Projects/Data Analyst Imperial College/Uploaded Doc/OULAD_raw/assessments.csv')
df_assessments.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [5]:
# Add code_module to studentAssessment.csv
df_merge = df.merge(df_assessments[['id_assessment', 'code_module']], 
                    on='id_assessment', 
                    how='left')

df_merge.head()

   id_assessment  id_student  date_submitted  is_banked  score code_module
0           1752       11391              18          0   78.0         AAA
1           1752       28400              22          0   70.0         AAA
2           1752       31604              17          0   72.0         AAA
3           1752       32885              26          0   69.0         AAA
4           1752       38053              19          0   79.0         AAA

In [6]:
# List values under the code_module to check modules
df_merge.code_module.unique()

array(['AAA', 'BBB', 'CCC', 'DDD', 'EEE', 'FFF', 'GGG'], dtype=object)

In [7]:
# Create BBB module file
df_BBB = df_merge[df_merge['code_module'] == 'BBB']
df_BBB.count()

id_assessment     43032
id_student        43032
date_submitted    43032
is_banked         43032
score             42979
code_module       43032
dtype: int64

In [8]:
# Show rows where score is null
null_scores = df_BBB[df_BBB['score'].isnull()]
print(null_scores.head(4))
# Calculate the number of null values in the score column
null_values_score = df_BBB['score'].isnull().sum()
print(f"Number of null values in score: {null_values_score}")

      id_assessment  id_student  date_submitted  is_banked  score code_module
3358          14984      186780              77          0    NaN         BBB
3914          14984      531205              26          0    NaN         BBB
3943          14984      534151               7          0    NaN         BBB
4206          14984      549713              84          0    NaN         BBB
Number of null values in score: 53

In [9]:
# Show the cleansed data
df_BBB.head()

      id_assessment  id_student  date_submitted  is_banked  score code_module
3149          14984     1008675              19          0   70.0         BBB
3150          14984     1098728              19          0   75.0         BBB
3151          14984     1413989              30          0   86.0         BBB
3152          14984     1436591              14          0   77.0         BBB
3153          14984     1480800              15          0   77.0         BBB

In [10]:
# Save the filtered data to a new CSV file
df_BBB.to_csv(f'{root_path}/OULAD_BBB_clean/studentAssessment_BBB.csv', index=False)

In [11]:
# Save the filtered data to a new parquet file for Power BI
df_BBB.to_parquet(f'{root_path}/OULAD_BBB_clean/studentAssessment_BBB.parquet', index=False)